renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA6T2BD.h
        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR0_b;
    };

    union
    {
        __IOM uint32_t ADSGDCR1;        /*!< (@ 0x00000204) Scan Group Diagnosis Function Control Register
                                         *                  1                                                          */

        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR1_b;
    };

    union
    {
        __IOM uint32_t ADSGDCR2;        /*!< (@ 0x00000208) Scan Group Diagnosis Function Control Register
                                         *                  2                                                          */

        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR2_b;
    };

    union
    {
        __IOM uint32_t ADSGDCR3;        /*!< (@ 0x0000020C) Scan Group Diagnosis Function Control Register
                                         *                  3                                                          */

        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR3_b;
    };

    union
    {
        __IOM uint32_t ADSGDCR4;        /*!< (@ 0x00000210) Scan Group Diagnosis Function Control Register
                                         *                  4                                                          */

        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR4_b;
    };

    union
    {
        __IOM uint32_t ADSGDCR5;        /*!< (@ 0x00000214) Scan Group Diagnosis Function Control Register
                                         *                  5                                                          */

        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR5_b;
    };

    union
    {
        __IOM uint32_t ADSGDCR6;        /*!< (@ 0x00000218) Scan Group Diagnosis Function Control Register
                                         *                  6                                                          */

        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR6_b;
    };

    union
    {
        __IOM uint32_t ADSGDCR7;        /*!< (@ 0x0000021C) Scan Group Diagnosis Function Control Register
                                         *                  7                                                          */

        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR7_b;
    };

    union
    {
        __IOM uint32_t ADSGDCR8;        /*!< (@ 0x00000220) Scan Group Diagnosis Function Control Register
                                         *                  8                                                          */

        struct
        {
            __IOM uint32_t DIAGVAL : 3; /*!< [2..0] Self-diagnosis Voltage Selection                                   */
            uint32_t               : 13;
            __IOM uint32_t ADDISEN : 1; /*!< [16..16] Disconnection Detection Assist Enable                            */
            uint32_t               : 3;
            __IOM uint32_t ADDISP  : 1; /*!< [20..20] Disconnection Detection Assist Mode Selection                    */
            __IOM uint32_t ADDISN  : 1; /*!< [21..21] Disconnection Detection Assist Mode Selection                    */
            uint32_t               : 2;
            __IOM uint32_t ADNDIS  : 4; /*!< [27..24] Disconnection Detection Assist Period                            */
            uint32_t               : 4;
        } ADSGDCR8_b;
    };
    __IM uint32_t RESERVED14[7];

    union
    {
        __IOM uint32_t ADSSTR0;        /*!< (@ 0x00000240) Sampling State Table Register 0                            */

        struct
        {
            __IOM uint32_t SST0 : 10;  /*!< [9..0] Sampling State Table 0                                             */
            uint32_t            : 6;
            __IOM uint32_t SST1 : 10;  /*!< [25..16] Sampling State Table 1                                           */
            uint32_t            : 6;
        } ADSSTR0_b;
    };

    union
    {
        __IOM uint32_t ADSSTR1;        /*!< (@ 0x00000244) Sampling State Table Register 1                            */

        struct
        {
            __IOM uint32_t SST2 : 10;  /*!< [9..0] Sampling State Table 2                                             */
            uint32_t            : 6;
            __IOM uint32_t SST3 : 10;  /*!< [25..16] Sampling State Table 3                                           */
            uint32_t            : 6;
        } ADSSTR1_b;
    };

    union
    {
        __IOM uint32_t ADSSTR2;        /*!< (@ 0x00000248) Sampling State Table Register 2                            */

        struct
        {
            __IOM uint32_t SST4 : 10;  /*!< [9..0] Sampling State Table 4                                             */
            uint32_t            : 6;
            __IOM uint32_t SST5 : 10;  /*!< [25..16] Sampling State Table 5                                           */
            uint32_t            : 6;
        } ADSSTR2_b;
    };

    union
    {
        __IOM uint32_t ADSSTR3;        /*!< (@ 0x0000024C) Sampling State Table Register 3                            */

        struct
        {
            __IOM uint32_t SST6 : 10;  /*!< [9..0] Sampling State Table 6                                             */
            uint32_t            : 6;
            __IOM uint32_t SST7 : 10;  /*!< [25..16] Sampling State Table 7                                           */
            uint32_t            : 6;
        } ADSSTR3_b;
    };

    union
    {
        __IOM uint32_t ADSSTR4;        /*!< (@ 0x00000250) Sampling State Table Register 4                            */

        struct
        {
            __IOM uint32_t SST8 : 10;  /*!< [9..0] Sampling State Table 8                                             */
            uint32_t            : 6;
            __IOM uint32_t SST9 : 10;  /*!< [25..16] Sampling State Table 9                                           */
            uint32_t            : 6;
        } ADSSTR4_b;
    };

    union
    {
        __IOM uint32_t ADSSTR5;        /*!< (@ 0x00000254) Sampling State Table Register 5                            */

        struct
        {
            __IOM uint32_t SST10 : 10; /*!< [9..0] Sampling State Table 10                                            */
            uint32_t             : 6;
            __IOM uint32_t SST11 : 10; /*!< [25..16] Sampling State Table 11                                          */
            uint32_t             : 6;
        } ADSSTR5_b;
    };

    union
    {
        __IOM uint32_t ADSSTR6;        /*!< (@ 0x00000258) Sampling State Table Register 6                            */

        struct
        {
            __IOM uint32_t SST12 : 10; /*!< [9..0] Sampling State Table 12                                            */
            uint32_t             : 6;
            __IOM uint32_t SST13 : 10; /*!< [25..16] Sampling State Table 13                                          */
            uint32_t             : 6;
        } ADSSTR6_b;
    };

    union
    {
        __IOM uint32_t ADSSTR7;        /*!< (@ 0x0000025C) Sampling State Table Register 7                            */

        struct
        {
            __IOM uint32_t SST14 : 10; /*!< [9..0] Sampling State Table 14                                            */
            uint32_t             : 6;
            __IOM uint32_t SST15 : 10; /*!< [25..16] Sampling State Table 15                                          */
            uint32_t             : 6;
        } ADSSTR7_b;
    };

    union
    {
        __IOM uint32_t ADCNVSTR;       /*!< (@ 0x00000260) A/D Conversion State Register                              */

        struct
        {
            __IOM uint32_t CST0 : 6;   /*!< [5..0] A/D Converter Unit 0 (ADC0)                                        */
            uint32_t            : 2;
            __IOM uint32_t CST1 : 6;   /*!< [13..8] A/D Converter Unit 1 (ADC1)                                       */
            uint32_t            : 18;
        } ADCNVSTR_b;
    };

    union
    {
        __IOM uint32_t ADCALSTCR;         /*!< (@ 0x00000264) A/D Converter Calibration State Register                   */

        struct
        {
            __IOM uint32_t CALADSST : 10; /*!< [9..0] A/D Converter Calibration Sampling Time Configuration              */
            uint32_t                : 6;
            __IOM uint32_t CALADCST : 6;  /*!< [21..16] A/D Converter Calibration Conversion Time Configuration.         */
            uint32_t                : 10;
        } ADCALSTCR_b;
    };
    __IM uint32_t RESERVED15[6];

    union
    {
        __IOM uint32_t ADSHCR0;        /*!< (@ 0x00000280) Channel-Dedicated Sample-and-Hold Circuit Control
                                        *                  Register 0                                                 */

        struct
        {
            __IOM uint32_t SHEN0 : 1;  /*!< [0..0] Channel-Dedicated Sample-and-Hold Circuit Unit 0 Select            */
            __IOM uint32_t SHEN1 : 1;  /*!< [1..1] Channel-Dedicated Sample-and-Hold Circuit Unit 1 Select            */
            __IOM uint32_t SHEN2 : 1;  /*!< [2..2] Channel-Dedicated Sample-and-Hold Circuit Unit 2 Select            */
            uint32_t             : 29;
        } ADSHCR0_b;
    };
    __IM uint32_t RESERVED16;

    union
    {
        __IOM uint32_t ADSHSTR0;       /*!< (@ 0x00000288) Channel-Dedicated Sample & Hold Circuit State
                                        *                  Register 0                                                 */

        struct
        {
            __IOM uint32_t SHSST : 8;  /*!< [7..0] Channel-Dedicated Sample-and-Hold Circuit Unit 0 to 2              */
            uint32_t             : 8;
            __IOM uint32_t SHHST : 3;  /*!< [18..16] Channel-Dedicated Sample-and-Hold Circuit Unit 0 to
                                        *   2                                                                         */
            uint32_t : 13;
        } ADSHSTR0_b;
    };

    union
    {
        __IOM uint32_t ADSHCR1;        /*!< (@ 0x0000028C) Channel-Dedicated Sample-and-Hold Circuit Control
                                        *                  Register 1                                                 */

        struct
        {
            __IOM uint32_t SHEN4 : 1;  /*!< [0..0] Channel-Dedicated Sample-and-Hold Circuit Unit 4 Select            */
            __IOM uint32_t SHEN5 : 1;  /*!< [1..1] Channel-Dedicated Sample-and-Hold Circuit Unit 5 Select            */
            __IOM uint32_t SHEN6 : 1;  /*!< [2..2] Channel-Dedicated Sample-and-Hold Circuit Unit 6 Select            */
            uint32_t             : 29;
        } ADSHCR1_b;
    };
    __IM uint32_t RESERVED17;

    union
    {
        __IOM uint32_t ADSHSTR1;       /*!< (@ 0x00000294) Channel-Dedicated Sample & Hold Circuit State
                                        *                  Register 1                                                 */

        struct
        {
            __IOM uint32_t SHSST : 8;  /*!< [7..0] Channel-Dedicated Sample-and-Hold Circuit Unit 4 to 6              */
            uint32_t             : 8;
            __IOM uint32_t SHHST : 3;  /*!< [18..16] Channel-Dedicated Sample-and-Hold Circuit Unit 4 to
                                        *   6                                                                         */
            uint32_t : 13;
        } ADSHSTR1_b;
    };
    __IM uint32_t RESERVED18[6];

    union
    {
        __IOM uint32_t ADCALSHCR;        /*!< (@ 0x000002B0) Channel-Dedicated Sample & Hold Circuit Calibration
                                          *                  State Register                                             */

        struct
        {
            __IOM uint32_t CALSHSST : 8; /*!< [7..0] Channel-Dedicated Sample & Hold Circuit Calibration Sampling
                                          *   Time Configuration                                                        */
            uint32_t                : 8;
            __IOM uint32_t CALSHHST : 3; /*!< [18..16] Channel-Dedicated Sample & Hold Circuit Calibration
                                          *   Holding Time Configuration                                                */
            uint32_t : 13;
        } ADCALSHCR_b;
    };
    __IM uint32_t RESERVED19[3];

    union
    {
        __IOM uint32_t ADPGACR[4];     /*!< (@ 0x000002C0) Programmable Gain Amplifier Control Register
                                        *                  [0..3]                                                     */

        struct
        {
            uint32_t                : 1;
            __IOM uint32_t PGADEN   : 1; /*!< [1..1] PGA Unit n Input Mode Select                                       */
            __IOM uint32_t PGASEL1  : 1; /*!< [2..2] PGA Unit n Transit Enable                                          */
            __IOM uint32_t PGAENAMP : 1; /*!< [3..3] PGA Unit n Enable                                                  */
            uint32_t                : 12;
            __IOM uint32_t PGAGEN   : 1; /*!< [16..16] PGA Unit n Gain Setting Enable                                   */
            uint32_t                : 3;
            __IOM uint32_t PGADG    : 2; /*!< [21..20] PGA Unit n Differential Input Gain Setting                       */
            uint32_t                : 2;
            __IOM uint32_t PGAGAIN  : 4; /*!< [27..24] PGA Unit n Gain Setting                                          */
            uint32_t                : 4;
        } ADPGACR_b[4];
    };
    __IM uint32_t RESERVED20[12];

    union
    {
        __IOM uint32_t ADPGAMONCR;      /*!< (@ 0x00000300) Programmable Gain Amp Monitor Output Control
                                         *                  Register                                                   */

        struct
        {
            __IOM uint32_t PGAMON  : 3; /*!< [2..0] PGA Monitor Signal Selection                                       */
            uint32_t               : 13;
            __IOM uint32_t MONSEL0 : 1; /*!< [16..16] PGA Unit 0 Monitor Output Enable                                 */
            __IOM uint32_t MONSEL1 : 1; /*!< [17..17] PGA Unit 1 Monitor Output Enable                                 */
            __IOM uint32_t MONSEL2 : 1; /*!< [18..18] PGA Unit 2 Monitor Output Enable                                 */
            __IOM uint32_t MONSEL3 : 1; /*!< [19..19] PGA Unit 3 Monitor Output Enable                                 */
            uint32_t               : 12;
        } ADPGAMONCR_b;
    };
    __IM uint32_t RESERVED21[7];

    union
    {
        __IOM uint32_t ADREFCR;        /*!< (@ 0x00000320) Internal Reference Voltage Monitor Enable Register         */

        struct
        {
            __IOM uint32_t VDE : 1;    /*!< [0..0] Internal Reference Voltage A/D Conversion Select                   */
            uint32_t           : 31;
        } ADREFCR_b;
    };
    __IM uint32_t RESERVED22[7];

    union
    {
        __IOM uint32_t ADDFSR0;        /*!< (@ 0x00000340) A/D Converter Digital Filter Selection Register
                                        *                  0                                                          */

        struct
        {
            __IOM uint32_t DFSEL0 : 2; /*!< [1..0] A/D Converter unit the 1st digital filter characteristic
                                        *   selection.                                                                */
            uint32_t              : 6;
            __IOM uint32_t DFSEL1 : 2; /*!< [9..8] A/D Converter unit the 2nd digital filter characteristic
                                        *   selection.                                                                */
            uint32_t              : 6;
            __IOM uint32_t DFSEL2 : 2; /*!< [17..16] A/D Converter unit the 2nd digital filter characteristic
                                        *   selection.                                                                */
            uint32_t              : 6;
            __IOM uint32_t DFSEL3 : 2; /*!< [25..24] A/D Converter unit the 4th digital filter characteristic
                                        *   selection.                                                                */
            uint32_t : 6;
        } ADDFSR0_b;
    };

    union
    {
        __IOM uint32_t ADDFSR1;        /*!< (@ 0x00000344) A/D Converter Digital Filter Selection Register
                                        *                  1                                                          */

